import React from 'react'
import './App.css'
import FuroreFont from './fonts/fonts.module.css' //webStorm обманывает шрифт подключается
import AppCSS from './styles/App.module.css'
function App() {
  return (
    <div className="App">
        <div className='Logo'>
            <svg width="500"
                 height="500"
                 xmlns="http://www.w3.org/2000/svg"
                 xmlnsXlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 // viewBox="0 0 100 300"
                 // viewBox="0 0 803 687"
                 viewBox="0 0 503 487"
                 preserveAspectRatio="xMidYMid meet"
                 // viewBox="-300 -20 803 587"
                 // style="enable-background:new 0 0 503 487;"
                 xmlSpace="preserve">
                <style>
                    {`.st0{opacity:0.85;fill:#5D5D5D;}`}
                    {`.st1{opacity:0.85;fill:#868686;}`}
                    {`.st2{fill:#535353;}`}
                    {`.st3{fill:none;}`}
                    {`.st4{fill:#FFFFFF;}`}
                    {`.st5{font-family:'Furore';}`}
                    {`.st6{font-size:61px;}`}
                    {`.st7{font-family:'MyriadPro-Regular';}`}
                </style>
                <g id="_x33_">
                    <path className="st0" d="M359.79,439.68l-216.95,7.57c-17.11,0.6-33.83-2.87-48.69-10.31c-31.18-15.62-73.03-51.25-55.89-127.09
                c1.89-8.36,4.84-16.53,8.61-24.35C96.58,182.48,157.96,90.42,179,59.84c6.49-9.43,14.28-17.92,23.19-25.1
                c31.97-25.81,107.45-69.21,176.27,22.73c70.8,104.19,104.92,181.78,117.71,214.54c4.87,12.49,7.3,25.97,7.01,39.74
                c-1.22,58.16-21.02,98.53-88.56,119.42C405.31,434.05,369.35,439.34,359.79,439.68z"/>
                </g>
                <g id="_x32_">
                    <path className="st1" d="M232.39,445.88L49.04,329.66c-14.46-9.16-26.3-21.47-34.37-36c-16.92-30.49-31.34-83.53,25.61-136.45
                c6.28-5.84,13.33-10.91,20.86-15.24C160.34,84.99,262.97,43.66,297.6,30.3c10.68-4.12,21.9-6.73,33.31-7.63
                c40.96-3.25,127.76,3.53,132.66,118.28c-0.38,125.97-16.02,209.27-23.96,243.54c-3.03,13.06-8.64,25.56-16.65,36.76
                c-33.84,47.31-72.98,69.46-140.52,48.57C273.13,466.93,240.47,451,232.39,445.88z"/>
                </g>
                <g id="_x31_">
                    <path className="st2" d="M198,432L61.15,280.39c-10.79-11.95-18.63-26.29-22.66-41.88c-8.48-32.72-10.01-86.22,51.23-123.45
                c6.75-4.11,14.02-7.32,21.55-9.71c99.24-31.51,198.22-47.42,231.5-52.23c10.26-1.48,20.68-1.41,30.91,0.31
                c36.72,6.19,111.65,32.28,91.83,142.07c-26.83,119.24-58.1,194.6-72.29,225.26c-5.41,11.68-12.97,22.25-22.38,31.05
                C331.11,488.96,292.03,501.08,237,466C229.42,461.17,204.03,438.67,198,432z"/>
                </g>
                <g id="text">
                    <rect x="164.24" y="240.12" className="st3" width="222.76" height="58.88"/>
                    <text transform="matrix(1 0 0 1 164.2354 285.6841)">
                        <tspan x="-40" y="0" className="st4 st5 st6">My Blog</tspan>
                        <tspan x="215.82" y="0" className="st7 st6"></tspan>
                    </text>
                </g>
            </svg>
        </div>

    </div>
  );
}

export default App;
